
import '../models/movies.dart';
const Mov = const[
  Movies(
      image: "assets/mov1.jpg",
      name: " Tron legacy ",
      id: "c1",
      desc: "تدور أحداث الفيلم داخل نظام الكمبيوتر (ENCOM)، حيث يقوم برنامج للألعاب الإلكترونية صممه (فلين كيفن) أثناء اللعبة بتحدي برنامج المراقبة الرئيسي، مما يتسبب في فوضى ودمار في أنحاء الشبكة، التي تقوم في إطار فانتازي بسحب مصممها إلى الداخل ليتحول إلى شخصية إلكترونية، داخل صراع محتوم يؤدي إلى الموت، بينما يحاول ابنه (شون فلين) البحث عن والده ليكتشف أن البرنامج صنع حالة من الفوضى في النظام فيقرر هو الأخر الدخول لإنقاذه."
      ,movieNumber: "c1",
      movietype: "خيال علمي/أكشن",
      productionyear:"2010" ,
      quality:"Bluray",
      duration: "125 min"),
  Movies(
      image:  "assets/mov2.jpg",
      name: " Star War  ",
      id: "c2",
      desc: "نظرا لأن عالمها يكتنفه الظلام، يجب على فتاة صغيرة التغلب على مخاوفها والسفر إلى مدينة النور الغامضة، وإنقاذ والدها من عالم خطير ومنع تدمير كوكبها"
      ,movieNumber: "m2",
      movietype: "الأنميشن, فانتازيا, مغامرات)",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "94 min"),
  Movies(
      image:  "assets/mov3.jpg",
      name: "  A christmas Carol ",
      id: "c3",
      desc: "العم (سكروج) رجل عجوز بخيل قاسي القلب، يواجه أشباح أعياد الميلاد من الماضي والحاضر والمستقبل، والتي تسعى إلى إدخال العطف إلى قلبه وجعله إنسان أفضل، وتحاول تحذيره مما سوف يؤول إليه إن استمر على نفس... اقرأ المزيد منوال حياته، مصطحبه إياه في رحلة مليئة بالغرائب."
      ,movieNumber: "c3",
      movietype: "عائلي/فنتازيا",
      productionyear:"2009" ,
      quality:"Bluray",
      duration: "96 min"),

  Movies(
      image:  "assets/mov4.jpg",
      name: "Avatar",
      id: "c4",
      desc: "حكي هذا الفيلم قصة جندي أمريكي مقعد يتم إرساله إلى قمر بعيد في الفضاء يسمى «باندورا»، الكوكب الذي تسكنه كائنات مسالمة زرقاء اللون تسمى «نأفيي» يبلغ طولهأ حوالي 3 أمتار. كانت تعيش بأمن واستقرار قبل وصول البشر الذين جاؤوا للتنقيب عن معدن ثمين جدا في هذا الكويكب."
      ,movieNumber: "c3",
      movietype: " خيال علمي واكشن",
      productionyear:"2009" ,
      quality:"Bluray",
      duration: "94 min"),




];

const AraMov = const[
  Movies(
      image:  "assets/aramov6.jpeg",
      name: "البس عشان خارجين ",
      id: "s1",
      desc: "(رمزي الدسوقي) شاب مستهتر في علاقاته النسائية، يقرر رئيسه في العمل تعريفه على ابنته (ليلى مراد) بغرض تزويجها منه والخلاص من مشاكلها التي لا تنتهي، ومع لقائهما، ..."
      ,movieNumber: "c3",
      movietype: " كوميدي",
      productionyear:"2016" ,
      quality:"Bluray",
      duration: "94 min"),

  Movies(
      image:  "assets/aramov1.jpeg",
      name: "ثانيه واحده ",
      id: "s2",
      desc: "تدور أحداث الفيلم في إطار رومانسي كوميدي، حيث يتعرف شاب على فتاة ويتسبب لها في الكثير من المشاكل، ثم يتعرض لحادث يقلب حياته بشكل كبير."
      ,movieNumber: "c3",
      movietype: "كوميدي و رومانسي  ",
      productionyear:"2021" ,
      quality:"Bluray",
      duration: "94 min"),

  Movies(
      image:  "assets/aramov3.jpeg",
      name: "لف و دوران ",
      id: "s3",
      desc: "(نور قباني) مرشد سياحي يذهب إلى شرم الشيخ مستغلًا عرض تقدمه الشركة لقضاء شهر العسل في سبيل مقابلة فتاة إيطالية تدعى (بيرلا)، وهناك يجدوا فتاة تدعى (ليلة) وتقيم في نفس الفيلا التي من المفترض أن يقيم... اقرأ المزيد فيها (نور) مع أسرته بنفس العرض الذي استغله (نور)، وتتحالف الأسرة مع (ليلة) ﻹفشال علاقته بـ(بيرلا)."
      ,movieNumber: "c3",
      movietype: "كوميدي و رومانسي  ",
      productionyear:"2016" ,
      quality:"Bluray",
      duration: "94 min"),

  Movies(
      image:  "assets/aramov2.jpeg",
      name: "وقفه رجاله  ",
      id: "s4",
      desc: "تدور أحداث العمل في قالب كوميدي حول مجموعة من الأصدقاء الذين يجتمعون بعد سنوات لمساعدة أحدهم في الخروج من أزمة نفسية لوفاة زوجته، وتتطوّر الأحداث فتقودهم للسفر إلى إحدى المدن الساحلية.."
      ,movieNumber: "c3",
      movietype: "كوميدي و رومانسي  ",
      productionyear:"2021" ,
      quality:"Bluray",
      duration: "56 min"),

  Movies(
      image:  "assets/aramov4.jpeg",
      name: "الفيل  ",
      id: "s5",
      desc: "يعيش (سامي) و(مكرم) وسط ظروف مادية صعبة؛ فيخططان للاستيلاء على قطعة أثرية ثمينة لتسديد ديونهما لدى صديقهما الثري (فريد)، فيمر الثنائي بسلسلة من المغامرات والمخاطر."
      ,movieNumber: "c3",
      movietype: "مغامرات  ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "56 min"),

  Movies(
      image:  "assets/aramov5.jpeg",
      name: "البعبع ",
      id: "s6",
      desc: "تدور أحداث الفيلم في يوم واحد حول سلطان، وهو مجرم مخضرم تم الإفراج عنه من السجن، ليقوم بعدها بعملية تسليم آثار لصالح أحد التجار، لكنه يغدر بهم ويستولي على ..."
      ,movieNumber: "c3",
      movietype: "كوميدي  ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "56 min"),


];

const Engmos = const[
  Movies(
      image:  "assets/engmos1.jpeg",
      name: "اطرق بابي ",
      id: "1",
      desc: "لقصة آيدا فتاة تربط كل آمالها بتعليمها تواجه سيركان بعد أن يقوم بقطع منحتها الدراسية في الخارج، فيقوم سيركان بتقديم عرض لآيدا حيث إذا مثلت انها خطيبته لشهرين سوف يرجع لها منحتها الدراسية بالرغم من كره آيدا له، كانت مضطرة لتقبل العرض لتغير ظروف حياتها."
      ,movieNumber: "c3",
      movietype: "تركي  كوميدي و رومانسي ",
      productionyear:"2020" ,
      quality:"Bluray",
      duration: "52 حلقه"),

  Movies(
      image:  "assets/engmos2.jpeg",
      name: " الحفره ",
      id: "1",
      desc: "أحداث المسلسل تدور حول أحد أحياء مدينة إسطنبول، بل ومن أكثرها خطورة، الذي تتحكم فيه عائله ، وتضع قوانينها في الحي حيث لا يمكن النقاش أو المجادلة في هذه القوانين، ومن أهم ما تم فرضه على سكان هذا الحي هو عدم المتاجرة بالمخدرات أبداً، وفي حال تم الخروج عن هذا القانون يطبق العقاب مباشرة.."
      ,movieNumber: "c3",
      movietype: "  تركي درامي وعائلي مليء بالأكشن والجريمة",
      productionyear:"2020" ,
      quality:"Bluray",
      duration: "132 حلقه"),

  Movies(
      image:  "assets/engmos3.jpeg",
      name: "  العهد ",
      id: "1",
      desc: "تدور قصة المسلسل عن فريق مختار من أقوى وأشجع العساكر في تركيا، تم تأسيسه للقبض على رؤساء المنظمات الإرهابية ومنع التفجيرات الإرهابية التي يدبرونها، ليعيش القائد يفوز وفريقه مجموعة من المغامرات..."
      ,movieNumber: "c3",
      movietype: "  تركي من نوع الأكشن الحربي ",
      productionyear:"2017" ,
      quality:"Bluray",
      duration: "84 حلقه"),

  Movies(
      image:  "assets/engmos4.jpeg",
      name:"اميره بلا تاج",
      id: "1",
      desc:"حول فتاة صغيرة تدعى ماسال Elif Kurtuaran نشأت على حكايات والدتها شيرين فريدة شتين والقصص الخيالية التي ترويها لها، ليتحول هذا الجمال إلى عالماً بارداً وواقعيًا عندما تدخل والدتها إلى المستشفى بسبب مرض في القلب."
      ,movieNumber: "c3",
      movietype: " واقعي و حزين جداااا ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "52 حلقه"),

];



const Aramos = const[
  Movies(
      image:  "assets/aramos1.jpeg",
      name: "العوده  ",
      id: "1",
      desc: "تدور أحداث المسلسل حول المحامي (آدم)، الذي يعود إلى مدينته بالأقصر بعد غياب سنوات بحثًا عن شقيقه المختفي في ظروف غامضة، حيث يكتشف أن سبب اختفاء شقيقه هو منجم."
      ,movieNumber: "c3",
      movietype: " إطار درامي ممزوج بالتشويق والإثارة ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "30 حلقه"),

  Movies(
      image:  "assets/aramos2.jpeg",
      name: " المداح اسطوره العشق ",
      id: "1",
      desc: "لبحث في الإعجاز العلمي في القرآن الكريم، حيث أن حمادة هلال القائم بدور الشيخ صابر المداح في قيامه بالتخلص من الجن الكبير الذي يقوم بمواجهته، ويتم هذا بعد أن يقوم الشيخ بحرق قبيلة هند بنت الأحمر في أخر الجزء الثالث وهذا الذي تم إذاعته في موسم رضان الماضى عام 2023"
      ,movieNumber: "c3",
      movietype: "ديني ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "30 حلقه"),

  Movies(
      image:  "assets/aramos3.jpeg",
      name: "  الهيبه ",
      id: "1",
      desc: "ينتقم جبل لمقتل شقيقه ويتحتم عليه خوض معركة جديدة بعد اكتشافه وجود مخططًا من قبل إرهابيين لتحويل السد المائي الذي يحمي الهيبة من الجفاف إلى منفذا للتهريب"
      ,movieNumber: "c3",
      movietype: " رومانسي درامي اكشن  ",
      productionyear:"2017" ,
      quality:"Bluray",
      duration: "5 اجزاء "),

  Movies(
      image:  "assets/aramos4.jpeg",
      name:"رشيد",
      id: "1",
      desc:"تدور قصة مسلسل رمضان الجديد رشيد حول تعرض ممدوح لحادث يقلب حياته رأسًا على عقب، حيث يتعرض للخيانة من أقرب أصدقائه وتزداد الأحداث تعقيدا بعد ...."
      ,movieNumber: "c3",
      movietype: "غموض و اثاره ",
      productionyear:"2023" ,
      quality:"Bluray",
      duration: "15 حلقه"),

];